# Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов. Программа должна работать следующим образом:

1. В начале у пользователя запрашивается количество билетов, которые он хочет приобрести на мероприятие.

2. Далее для каждого билета запрашивается возраст посетителя, в соответствии со значением которого выбирается стоимость:

        Если посетителю конференции менее 18 лет, то он проходит на конференцию бесплатно.
        От 18 до 25 лет — 990 руб.
        От 25 лет — полная стоимость 1390 руб.

3. В результате программы выводится сумма к оплате. При этом, если человек регистрирует больше трёх человек на конференцию, то дополнительно получает 10% скидку на полную стоимость заказа.

Решение:
amt_tickets = int(input('Введите количество билетов: ')) # просим ввести количество билетов на мероприятие
member_ages = []    # Создаем список, в котором будет храниться возраст участников

for i in range(0, amt_tickets):
    input_age = int(input(f'Введите возраст участника №{i + 1}:\n'))  # для каждого билета запросить возраст
    member_ages.append(input_age)               # Заполняем member_ages числами, которые вводит пользователь

    def prise(age):                               # исходя из возраста выбираем стоимость билета
        if age < 18:
            return 0
        elif 18 <= age < 25:
            return 990
        else:
            return 1390

full_prise = sum(map(prise, member_ages))          # считаем стоимость всех билетов

if amt_tickets > 3:
    full_prise = int(full_prise * 0.9)            # проводим скидку если количество билетов больше 3

print('Итоговая стоимость:', full_prise, 'руб.')
"C:\my python projects\pythonProject\venv\Scripts\python.exe" "C:\my python projects\pythonProject\Task_13_8_19.py" 
Введите количество билетов: 3
Введите возраст участника №1:
10
Введите возраст участника №2:
25
Введите возраст участника №3:
30
Итоговая стоимость: 2780 руб.

Process finished with exit code 0
